:PROPERTIES:
:ID:       1a0dd547-fb40-4319-bfb0-aefba74537ed
:END:
#+title: Advent of Code '21
#+property: header-args :session aoc :async yes :exports both :tangle yes :eval no-export

*** Solution
#+begin_src python :tangle /Users/cmetha/Documents/advent_of_code
count = 0

with open("/Users/cmehta/Documents/advent_of_code/inputs/1_solar_sweep.csv", "r") as f:
    lines = f.readlines()

previous_val = int(lines[0].strip())
for line in lines:
    number = int(line.strip())
    if number > previous_val:
        count += 1
    previous_val = number
print(count)
#+end_src

#+RESULTS:
: 1583
*** Solution
#+begin_src python :tangle /Users/cmetha/Documents/advent_of_code
count = 0

with open("/Users/cmehta/Documents/advent_of_code/inputs/1_solar_sweep.csv", "r") as f:
    lines = f.readlines()

previous_sum = int(lines[0].strip()) + int(lines[1].strip()) + int(lines[2].strip())
for i, line in enumerate(lines[:-2]):
    number = int(line.strip()) + int(lines[i+1].strip()) + int(lines[i+2].strip())
    if number > previous_sum:
        count += 1
    previous_sum = number
print(count)
#+end_src

#+RESULTS:
: 1627
** Solution
#+begin_src python
import pandas as pd

lines = []
with open("/Users/cmehta/Documents/advent_of_code/inputs/2_dive.csv", "r") as f:
    lines = f.readlines()

horizontal, depth = 0, 0
for line in lines:
    direction, value = line.split()
    if direction == "forward":
        horizontal += int(value)
    elif direction == "up":
        depth -= int(value)
    elif direction == "down":
        depth += int(value)

print(horizontal * depth)
#+end_src

#+RESULTS:
: 1962940
